The splitting boundary must divide the Surface into separate pieces. There may be a gap in the splitting Lines or the Sketch may be incomplete.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId SurfaceSplitNoIntersection { get; }
  Visual Basic
Public Shared ReadOnly Property SurfaceSplitNoIntersection As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SurfaceSplitNoIntersection {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SiteFailures Class
  Autodesk.Revit.DB Namespace